Revit 2026 API

# LocationMove Method

---

Move the element within the project by a specified vector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool Move(
	XYZ translation
)
```
```vb
Public Function Move (
	translation As XYZ
) As Boolean
```
```cpp
public:
bool Move(
	XYZ^ translation
)
```
```fsharp
member Move :
        translation : XYZ -> bool
```

#### Parameters

translation XYZ
    The vector by which the element is to be moved.

#### Return Value

BooleanIf the element is moved successfully then the method return True, otherwise False.

The move method is used to move an element within the project. Other elements may also be moved when this element is moved, for example: if the element is wall and it contains windows, the windows will also be moved.

#### Reference

Location Class

Autodesk.Revit.DB Namespace